# Parameters
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs

backbone:
  # [from, repeats, module, args]
  # ------------------ Stage 0: Input Enhancement ------------------
  - [-1, 1, Conv, [3, 3, 1]]  # 先将通道数转换为 3
  - [-1, 1, SCInet, [64, 3]]  # 0-P1/2, 初始残差增强

  # ------------------ Stage 1: Downsample P1/2 ------------------
  - [-1, 1, Conv, [64, 3, 2]]  # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4

  # ------------------ Stage 2: Dynamic Feature Extraction ------------------
  - [-1, 2, C3k2_PCCDSConv, [256, False, 0.25]]  # 3-P2/4 (增强动态卷积)
  - [-1, 1, Conv, [3, 3, 1]]  # 先将通道数转换为 3
  - [-1, 1, SCInet, [256, 2]]  # 4-中间层增强

  # ------------------ Stage 3: Downsample P3/8 ------------------
  - [-1, 1, Conv, [256, 3, 2]]  # 5-P3/8
  - [-1, 2, C3k2_PCCDSConv, [512, False, 0.25]]  # 6
  - [-1, 1, Conv, [3, 3, 1]]  # 先将通道数转换为 3
  - [-1, 1, SCInet, [512, 2]]  # 7-P3层前增强

  # ------------------ Stage 4: Downsample P4/16 ------------------
  - [-1, 1, Conv, [512, 3, 2]]  # 8-P4/16
  - [-1, 2, C3k2_PCCDSConv, [512, True]]  # 9 (启用完整动态蛇形卷积)

  # ------------------ Stage 5: Downsample P5/32 ------------------
  - [-1, 1, Conv, [1024, 3, 2]]  # 10-P5/32
  - [-1, 2, C3k2_PCCDSConv, [1024, True]]  # 11
  - [-1, 1, Conv, [3, 3, 1]]  # 先将通道数转换为 3
  - [-1, 1, SCInet, [1024, 3]]  # 12-P5层前深度增强

  # ------------------ Feature Pyramid ------------------
  - [-1, 1, SPPF, [1024, 5]]  # 13
  - [-1, 2, C2PSA, [1024]]  # 14

# Head with Enhanced Feature Fusion
head:
  # ------------------ Upsample P4 ------------------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[-1, 9], 1, Concat, [1]]  # 16 (cat from P4层)
  - [-1, 2, C3k2_PCCDSConv, [512, False]]  # 17

  # ------------------ Upsample P3 ------------------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 6], 1, Concat, [1]]  # 19 (cat from P3层)
  - [-1, 2, C3k2_PCCDSConv, [256, False]]  # 20 (P3/8-small)

  # ------------------ Downsample P4 ------------------
  - [-1, 1, Conv, [256, 3, 2]]  # 21
  - [[-1, 17], 1, Concat, [1]]  # 22 (cat head P4)
  - [-1, 2, C3k2_PCCDSConv, [512, False]]  # 23 (P4/16-medium)

  # ------------------ Downsample P5 ------------------
  - [-1, 1, Conv, [512, 3, 2]]  # 24
  - [[-1, 14], 1, Concat, [1]]  # 25 (cat head P5)
  - [-1, 2, C3k2_PCCDSConv, [1024, True]]  # 26 (P5/32-large)

  # ------------------ Detect Head ------------------
  - [[20, 23, 26], 1, Detect, [nc]]  # Detect(P3, P4, P5)