# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1  # number of classes
scales:  # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs

# Backbone
backbone:
  - [-1, 1, AdaptiveResEnhancer, [64, 3]]             # 0: 使用 AdaptiveResEnhancer 进行图像预处理
  - [-1, 1, Conv, [64, 3, 2]]           # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 2-P2/4
  - [-1, 2, C3k2_PCCDSConv, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]          # 4-P3/8
  - [-1, 2, C3k2_PCCDSConv, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]          # 6-P4/16
  - [-1, 2, C3k2_PCCDSConv, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]         # 8-P5/32
  - [-1, 2, C3k2_PCCDSConv, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]            # 10
  - [-1, 2, C2PSA_MLCA, [1024]]         # 11 (c2=1024, n=2)

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]           # 13-cat P4
  - [-1, 2, C3k2_PCCDSConv, [512, False]] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]           # 16-cat P3
  - [-1, 2, C3k2_PCCDSConv, [256, False]] # 17 (P3/8-small)
  - [-1, 1, MLCA, [256]]                # 18 (c2=256)

  - [-1, 1, Conv, [256, 3, 2]]          # 19
  - [[-1, 14], 1, Concat, [1]]          # 20-cat P4
  - [-1, 2, C3k2_PCCDSConv, [512, False]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]          # 22
  - [[-1, 11], 1, Concat, [1]]          # 23-cat P5
  - [-1, 2, C3k2_PCCDSConv, [1024, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]     # Detect(P3, P4, P5)
